JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
/* Volume response configuration */
volatile uint8_t  volume_response_nonlinear = 1;                    // Default: enabled
volatile float    volume_response_gamma     = 2.0f;                 // Default: quadratic (human perception)

/* Playback buffer */
int16_t pb_buffer[ PB_BUFF_SZ ] = {SAMPLE16_MIDPOINT};              // Initialize to silence (midpoint for unsigned samples)

/* Filter configuration (runtime-tunable) */
volatile FilterConfig_TypeDef filter_cfg = {
  .enable_16bit_biquad_lpf      = 1,
  .enable_soft_dc_filter_16bit  = 1,
  .enable_8bit_lpf              = 1,
  .enable_noise_gate            = 0,
  .enable_soft_clipping         = 1,
  .enable_air_effect            = 0,
  .lpf_makeup_gain_q16          = LPF_MAKEUP_GAIN_Q16,
  .lpf_makeup_gain_16bit_q16    = LPF_16BIT_MAKEUP_GAIN_Q16,
  .lpf_16bit_level              = LPF_Custom,
  .lpf_16bit_custom_alpha       = LPF_16BIT_SOFT,
  .lpf_8bit_level               = LPF_Medium,
  .lpf_8bit_custom_alpha        = LPF_MEDIUM,
  .enable_filter_chain_16bit    = 1,
  .enable_filter_chain_8bit     = 1
};

/* Playback state variables */
  volatile  uint8_t         *pb_p8_ptr;                               // Pointer for 8-bit sample processing
volatile  uint8_t           *pb_end8_ptr;                             // End pointer for 8-bit sample processing
volatile  uint16_t          *pb_p16_ptr;                              // Pointer for 16-bit sample processing
volatile  uint16_t          *pb_end16_ptr;                            // End pointer for 16-bit sample processing
volatile  uint8_t           *pb_padpcm_ptr;                           // Pointer for ADPCM source bytes
volatile  uint8_t           *pb_endadpcm_ptr;                         // End pointer for ADPCM source bytes

volatile  PB_StatusTypeDef  pb_state                    = PB_Idle;    // Playback state machine variable
volatile  uint8_t           half_to_fill;                             // Flag to indicate which half of the buffer to fill in the DMA callback
          uint8_t           pb_mode;                                  // Mono or stereo mode (set by application before playback)
          uint32_t          I2S_PlaybackSpeed           = 22025;      // Default playback speed in Hz
volatile  uint32_t          playback_total_samples      = 0;          // Total source samples scheduled for current playback session
volatile  uint32_t          playback_samples_played     = 0;          // Source samples already played by DMA
volatile  uint32_t          dma_half_sample_counts[ 2 ] = { 0U, 0U }; // Valid source samples currently queued in each DMA half

/* Playback engine control variables */
          uint32_t          p_advance;                                // Number of samples to advance in current buffer.
          PB_ModeTypeDef    channels                    = Mode_mono;  // Default to mono; set to Mode_stereo for stereo playback.
volatile  uint32_t          samples_remaining           = 0;          // Total samples remaining in current playback (used for tracking when to stop)
volatile  uint32_t          fadein_samples_remaining    = 0;          // Fade-in samples remaining, used for applying fade-in effect over specified duration
volatile  uint32_t          fadeout_samples_remaining   = 0;          // Fade-out samples remaining, used for applying fade-out effect over specified duration
volatile  uint32_t          paused_samples_remaining    = 0;          // Saved remaining samples at pause point (used to resume correctly)

/* Fade time configuration (stored in seconds, converted to samples based on playback speed) */
          float           fadein_time_seconds           = 0.150f;     // 150ms default
          float           fadeout_time_seconds          = 0.150f;     // 150ms default
          float           pause_fadeout_time_seconds    = 0.100f;     // 100ms default
          float           pause_fadein_time_seconds     = 0.100f;     // 100ms default
          uint32_t        fadein_samples                = 3300;       // Calculated fade in time from time and speed
          uint32_t        fadeout_samples               = 3300;       // Calculated fade out time from time and speed
          uint32_t        pause_fadeout_samples         = 2200;       // Calculated pause fade out time from time and speed
          uint32_t        pause_fadein_samples          = 2200;       // Calculated pause fade in time from time and speed

/* Per-channel state for filters that require memory of previous samples */
typedef struct AudioFilterChannelState {
  volatile int32_t dc_prev_input;
  volatile int32_t dc_prev_output;
  volatile int32_t lpf8_x1;
  volatile int32_t lpf8_x2;
  volatile int32_t lpf8_y1;
  volatile int32_t lpf8_y2;
  volatile int32_t lpf16_x1;
  volatile int32_t lpf16_x2;
  volatile int32_t lpf16_y1;
  volatile int32_t lpf16_y2;
  volatile int32_t air_x1;
  volatile int32_t air_y1;
} AudioFilterChannelState;

static AudioFilterChannelState filter_state[ CHANNEL_COUNT ] = {0}; // Initialize all filter state to zero

/* Dither state */
volatile  uint32_t        dither_state                = DITHER_SEED_DEFAULT;
          uint16_t        lpf_8bit_alpha              = LPF_MEDIUM;

/* Biquad filter state for 16-bit samples */
volatile  uint16_t        lpf_16bit_alpha             = LPF_16BIT_SOFT;

/* IMA ADPCM decoder state (predictor + step index) for each channel */
volatile int16_t          adpcm_predictor_l           = 0;
volatile int16_t          adpcm_predictor_r           = 0;
volatile int8_t           adpcm_step_index_l          = 0;
volatile int8_t           adpcm_step_index_r          = 0;

/* IMA ADPCM lookup tables */
static const int8_t ima_adpcm_index_table[ 16 ] = {
  -1, -1, -1, -1,
   2,  4,  6,  8,
  -1, -1, -1, -1,
   2,  4,  6,  8
};

static const int16_t ima_adpcm_step_table[ 89 ] = {
      7,     8,     9,    10,    11,    12,    13,    14,    16,    17,
     19,    21,    23,    25,    28,    31,    34,    37,    41,    45,
     50,    55,    60,    66,    73,    80,    88,    97,   107,   118,
    130,   143,   157,   173,   190,   209,   230,   253,   279,   307,
    337,   371,   408,   449,   494,   544,   598,   658,   724,   796,
    876,   963,  1060,  1166,  1282,  1411,  1552,  1707,  1878,  2066,
   2272,  2499,  2749,  3024,  3327,  3660,  4026,  4428,  4871,  5358,
   5894,  6484,  7132,  7845,  8630,  9493, 10442, 11487, 12635, 13899,
  15289, 16818, 18500, 20350, 22385, 24623, 27086, 29794, 32767
};

