JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
#if AUDIO_ENGINE_ENABLE_AIR_EFFECT
/* Air Effect runtime shelf gain (Q16). Defaults to AIR_EFFECT_SHELF_GAIN */
volatile  int32_t         air_effect_shelf_gain_q16   = AIR_EFFECT_SHELF_GAIN;

/* Air Effect preset table (dB) */
static const float        air_effect_presets_db[]     = { 1.0f, 2.0f, 3.0f };
#define AIR_EFFECT_PRESET_COUNT ( (uint8_t)( sizeof(air_effect_presets_db) / sizeof(air_effect_presets_db[0]) ) )
static volatile uint8_t   air_effect_preset_idx       = 1;          // default +2 dB
#endif

/* Pause/resume state tracking */
volatile  const void      *paused_sample_ptr          = NULL;       // Pointer to sample position where pause was initiated, used for resuming from same position

/* Stop request flag for asynchronous stop with fade-out */
volatile  uint8_t         stop_requested              = 0;          // Set to 1 to request a stop with fade-out, used for asynchronous stop handling in main loop

/* Playback end callback invocation guard - ensures callback is called only once */
volatile  uint8_t         playback_end_callback_called = 0;         // Flag to ensure playback end callback is only called once per playback session, prevents multiple invocations in edge cases

/* DAC power control flag */
volatile  uint8_t         dac_power_control           = true;       // Default to enabled


/* ===== Filter State Reset Helpers ===== */

/** Reset per-channel filter state to zero
  *
  * @param: state - Channel state to clear
  */
static inline void ResetFilterChannelState( AudioFilterChannelState *state )
{
  state->dc_prev_input = 0;
  state->dc_prev_output = 0;
  state->lpf8_x1 = 0;
  state->lpf8_x2 = 0;
  state->lpf8_y1 = 0;
  state->lpf8_y2 = 0;
  state->lpf16_x1 = 0;
  state->lpf16_x2 = 0;
  state->lpf16_y1 = 0;
  state->lpf16_y2 = 0;
  state->air_x1 = 0;
  state->air_y1 = 0;
}


/** Reset all per-channel filter state to zero
  *
  * @param: none
  */
static inline void ResetAllFilterState( void )
{
  ResetFilterChannelState( &filter_state[ CHANNEL_LEFT ] );
  ResetFilterChannelState( &filter_state[ CHANNEL_RIGHT ] );
}


/** Get pointer to channel filter state
  *
  * @param: channel_id - CHANNEL_LEFT or CHANNEL_RIGHT
  * @retval: AudioFilterChannelState* - Channel state pointer
  */
static inline AudioFilterChannelState *GetChannelState( AudioChannelId channel_id )
{
  return &filter_state[ channel_id ];
}


/** Return non-zero if mode is one of the IMA ADPCM playback modes. */
static inline uint8_t IsAdpcmPlaybackMode( PB_ModeTypeDef mode )
{
  return ( mode == Mode_mono_ADPCM || mode == Mode_stereo_ADPCM ) ? 1U : 0U;
}


/** Return non-zero when the mode has independent left/right source channels. */
static inline uint8_t IsStereoPlaybackMode( PB_ModeTypeDef mode )
{
  return ( mode == Mode_stereo || mode == Mode_stereo_ADPCM ) ? 1U : 0U;
}


/** Decode one IMA ADPCM nibble into a signed 16-bit PCM sample. */
static int16_t DecodeImaAdpcmNibble( uint8_t nibble, volatile int16_t *predictor, volatile int8_t *step_index )
{
  int32_t index = *step_index;
  if( index < 0 ) {
    index = 0;
  } else if( index > 88 ) {
    index = 88;
  }

  int32_t step = ima_adpcm_step_table[ index ];
  int32_t diff = step >> 3;

  if( nibble & 0x01U ) { diff += step >> 2; }
  if( nibble & 0x02U ) { diff += step >> 1; }
  if( nibble & 0x04U ) { diff += step; }

  int32_t sample = *predictor;
  if( nibble & 0x08U ) {
    sample -= diff;
  } else {
    sample += diff;
  }

  if( sample > AUDIO_INT16_MAX ) {
    sample = AUDIO_INT16_MAX;
  } else if( sample < AUDIO_INT16_MIN ) {
    sample = AUDIO_INT16_MIN;
  }

  index += ima_adpcm_index_table[ nibble & 0x0FU ];
  if( index < 0 ) {
    index = 0;
  } else if( index > 88 ) {
    index = 88;
  }

  *predictor = (int16_t)sample;
  *step_index = (int8_t)index;
  return (int16_t)sample;
}


/* ===== Audio Engine Initialization ===== */

/** Initialize the audio engine with hardware interface functions
  * 
  * @brief Initializes the audio engine and validates that all required hardware
  *        interface functions have been provided. Resets all filter state and
  *        playback variables to safe defaults.
  * 
  * @param: dac_switch - Function pointer for DAC on/off control
  * @param: read_volume - Function pointer for reading volume setting
  * @param: i2s_init - Function pointer for I2S initialization
  * @retval: PB_Playing if initialization successful, PB_Error if any pointer is NULL
  */
PB_StatusTypeDef AudioEngine_Init( DAC_SwitchFunc dac_switch,
                                   ReadVolumeFunc read_volume,
                                   I2S_InitFunc i2s_init )
{
  /* Validate that all required function pointers are provided */
  if( dac_switch == NULL || read_volume == NULL || i2s_init == NULL ) {
    return PB_Error;
  }

  /* Assign hardware interface functions */
  AudioEngine_DACSwitch   = dac_switch;
  AudioEngine_ReadVolume  = read_volume;
  AudioEngine_I2SInit     = i2s_init;
  
  /* Reset all filter state variables to clean state */
  ResetAllFilterState();
  
  /* Reset playback state variables */
  pb_state                                  = PB_Idle;
  pb_mode                                   = 0;
  fadeout_samples_remaining                 = 0;
  fadein_samples_remaining                  = 0;
  paused_sample_ptr                         = NULL;
  vol_input                                 = DEFAULT_VOLUME_INPUT;  // Safe default above noise floor
  
  /* Reset dither state to non-zero seed */
  dither_state = DITHER_SEED_DEFAULT;
  
  /* Initialize default filter configuration */
  filter_cfg.enable_16bit_biquad_lpf        = 1;
  filter_cfg.enable_soft_dc_filter_16bit    = 1;
  filter_cfg.enable_8bit_lpf                = 1;
  filter_cfg.enable_noise_gate              = 0;
  filter_cfg.enable_soft_clipping           = 1;
  filter_cfg.enable_air_effect              = 0;
  filter_cfg.lpf_makeup_gain_q16            = LPF_MAKEUP_GAIN_Q16;
  filter_cfg.lpf_makeup_gain_16bit_q16      = LPF_16BIT_MAKEUP_GAIN_Q16;
  filter_cfg.lpf_16bit_level                = LPF_Soft;
  filter_cfg.lpf_8bit_level                 = LPF_Medium;
  filter_cfg.lpf_8bit_custom_alpha          = LPF_MEDIUM;
  filter_cfg.enable_filter_chain_16bit      = 1;
  filter_cfg.enable_filter_chain_8bit       = 1;
  
  return PB_Idle;  // Success - ready to play but not currently playing
}


/* ===== Filter Configuration Functions ===== */

/** Setup filter configuration 
  * 
  * @brief Sets the filter configuration parameters.
  * @param: cfg - Pointer to FilterConfig_TypeDef structure with desired settings.
  * @retval: none
  */
void SetFilterConfig( const FilterConfig_TypeDef *cfg )
{
  if( cfg != NULL ) {
    filter_cfg = *cfg;
    // Ensure a sane makeup gain (default if zero, cap if too high)
    if( filter_cfg.lpf_makeup_gain_q16 == 0 ) {
      filter_cfg.lpf_makeup_gain_q16 = LPF_MAKEUP_GAIN_Q16;
    }
    else if( filter_cfg.lpf_makeup_gain_q16 > AIR_EFFECT_SHELF_GAIN_MAX ) {
      filter_cfg.lpf_makeup_gain_q16 = AIR_EFFECT_SHELF_GAIN_MAX;
    }
    if( filter_cfg.lpf_makeup_gain_16bit_q16 == 0 ) {
      filter_cfg.lpf_makeup_gain_16bit_q16 = LPF_16BIT_MAKEUP_GAIN_Q16;
    }
    else if( filter_cfg.lpf_makeup_gain_16bit_q16 > AIR_EFFECT_SHELF_GAIN_MAX ) {
      filter_cfg.lpf_makeup_gain_16bit_q16 = AIR_EFFECT_SHELF_GAIN_MAX;
    }
  }
}


/** Get current filter configuration 
  * 
  * @brief Retrieves the current filter configuration parameters.
  * @param: cfg - Pointer to FilterConfig_TypeDef structure to populate.
  * @retval: none
  */
void GetFilterConfig( FilterConfig_TypeDef *cfg )
{
  if( cfg != NULL ) {
    *cfg = filter_cfg;
  }
}


