JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
/** Set whether or not to use soft clipping
  *
  * @brief Enables or disables the soft clipping filter.
  * @param: enabled - Non-zero to enable, zero to disable.
  * @retval: none
  */
void SetSoftClippingEnable( uint8_t enabled )
{
  filter_cfg.enable_soft_clipping = enabled ? 1 : 0;
}


/** Get whether or not soft clipping is enabled
  *
  * @brief Retrieves the current state of the soft clipping filter.
  * @param: none
  * @retval: non-zero if enabled, zero if disabled.
  */
uint8_t GetSoftClippingEnable( void )
{
  return filter_cfg.enable_soft_clipping;
}


/** Set the aggressiveness level for the 8-bit low-pass filter.
  * 
  * @brief Sets the filter level for the 8-bit biquad low-pass filter.
  * @param: level - Filter level (LPF_VerySoft, LPF_Soft, LPF_Medium, LPF_Firm, LPF_Aggressive, LPF_Custom).
  * @retval: none
  */
void SetLpf8BitLevel( LPF_Level level )
{
  if( level == LPF_Off ) {
    filter_cfg.enable_8bit_lpf = 0;
  } else {
    filter_cfg.enable_8bit_lpf = 1;
    if( level > LPF_Custom ) { // Prevent invalid off state
      level = LPF_VerySoft;
    }
  }
  filter_cfg.lpf_8bit_level = level;
}


/* Get the 8-bit low-pass filter aggressiveness level 
 * @param: none
 * @retval: current filter level
 */
LPF_Level GetLpf8BitLevel(void)
{
  return filter_cfg.lpf_8bit_level;
}


/** Set a custom alpha for the 8-bit low-pass filter
  * @param: alpha - Custom alpha value in Q16 format (0-65535)
  * @retval: none
  */
void SetLpf8BitCustomAlpha( uint16_t alpha )
{
  filter_cfg.lpf_8bit_custom_alpha = alpha;
  filter_cfg.lpf_8bit_level = LPF_Custom;
  filter_cfg.enable_8bit_lpf = 1;
  lpf_8bit_alpha = alpha;
}


/** Get the current custom alpha for the 8-bit low-pass filter
  * @param: none
  * @retval: current custom alpha in Q16 format
  */
uint16_t GetLpf8BitCustomAlpha( void )
{
  return filter_cfg.lpf_8bit_custom_alpha;
}


/** Set the aggressiveness level for the 16-bit biquad low-pass filter.
  * 
  * @brief Sets the filter level for the 16-bit biquad low-pass filter.
  * @param: level - Filter level (LPF_VerySoft, LPF_Soft, LPF_Medium, LPF_Firm, LPF_Aggressive, LPF_Custom).
  * @retval: none
  */
void SetFilterChain8BitEnable( uint8_t enabled )
{
  filter_cfg.enable_filter_chain_8bit = enabled ? 1 : 0;
}


/* Get whether the 8-bit filter chain is enabled 
 * @param: none
 * @retval: non-zero if enabled, zero if disabled
 */
uint8_t GetFilterChain8BitEnable( void )
{
  return filter_cfg.enable_filter_chain_8bit;
}


/* Set whether the 16-bit filter chain is enabled
 * @param: enabled - Non-zero to enable, zero to disable.
 * @retval: none
 */
void SetFilterChain16BitEnable( uint8_t enabled )
{
  filter_cfg.enable_filter_chain_16bit = enabled ? 1 : 0;
}


/* Get whether the 16-bit filter chain is enabled 
 * @param: none
 * @retval: non-zero if enabled, zero if disabled
 */
uint8_t GetFilterChain16BitEnable( void )
{
  return filter_cfg.enable_filter_chain_16bit;
}


/* Air Effect runtime control */

#if AUDIO_ENGINE_ENABLE_AIR_EFFECT
/** Sets whether to use the air effect or not
  * @param: enabled - Non-zero to enable, zero to disable.
  * @retval: none
  */
void SetAirEffectEnable( uint8_t enabled )
{
  filter_cfg.enable_air_effect = enabled ? 1 : 0;
}


/** Gets the state of the air effect enable flag
  * @param: none
  * @retval: non-zero if enabled, zero if disabled.
  */
uint8_t GetAirEffectEnable( void )
{
  return filter_cfg.enable_air_effect;
}


/** Air Effect runtime control: set shelf boost gain (Q16)
  * Clamps to AIR_EFFECT_SHELF_GAIN_MAX to avoid extreme boosts.
  * @param: gain_q16 - Desired shelf gain in Q16 format
  * @retval: none
  */
void SetAirEffectGainQ16( uint32_t gain_q16 )
{
  if( gain_q16 > AIR_EFFECT_SHELF_GAIN_MAX ) {
    gain_q16 = AIR_EFFECT_SHELF_GAIN_MAX;
  }
  air_effect_shelf_gain_q16 = (int32_t)gain_q16;
}


/** Air Effect runtime control: get current shelf boost gain (Q16)
  * @retval: current shelf gain in Q16
  */
uint32_t GetAirEffectGainQ16( void )
{
  return (uint32_t) air_effect_shelf_gain_q16;
}


/** Air Effect runtime control: set shelf boost using dB
  * Converts desired high-frequency boost (at ω=π) to internal G (Q16).
  * Formula: Hπ = 10^(db/20), G = (Hπ*(2-α) - α) / (2*(1-α))
  * @param: db - Desired boost in dB
  * @retval: none
  */
void SetAirEffectGainDb( float db )
{
  const float alpha               = (float)AIR_EFFECT_CUTOFF / Q16_SCALE_F;
  const float one_minus_alpha     = 1.0f - alpha;
  const float Hpi                 = powf( 10.0f, db / 20.0f );
  float G                         = (Hpi * ( 2.0f - alpha ) - alpha ) / ( 2.0f * one_minus_alpha );
  if( G < 0.0f ) G = 0.0f;
  uint32_t gain_q16               = (uint32_t)(G * Q16_SCALE_F + 0.5f);
  if( gain_q16 > AIR_EFFECT_SHELF_GAIN_MAX ) {
    gain_q16                      = AIR_EFFECT_SHELF_GAIN_MAX;
  }
  SetAirEffectGainQ16( gain_q16 );
}


/** Air Effect runtime control: get current shelf boost in dB (at ω=π)
  * Formula: Hπ = (α + 2(1-α)G) / (2-α), db = 20*log10(Hπ)
  * @retval: current boost in dB
  */
float GetAirEffectGainDb( void )
{
  const float alpha               = (float) AIR_EFFECT_CUTOFF / Q16_SCALE_F;
  const float one_minus_alpha     = 1.0f - alpha;
  const float G                   = (float) air_effect_shelf_gain_q16 / Q16_SCALE_F;
  const float Hpi                 = ( alpha + 2.0f * one_minus_alpha * G ) / ( 2.0f - alpha );
  return 20.0f * log10f( Hpi );
}


/** Air Effect preset selection by index
  * @param: preset_index - Index of desired preset (0 disables, >0 enables with that preset)
  * @retval: none
  */
void SetAirEffectPresetDb( uint8_t preset_index )
{
  if( preset_index >= AIR_EFFECT_PRESET_COUNT ) {
    preset_index = 0;
  }
  air_effect_preset_idx = preset_index;
  
  /* Auto-enable/disable air effect based on preset: 0 = off, >0 = on */
  SetAirEffectEnable( preset_index > 0 ? 1 : 0 );
  
  SetAirEffectGainDb( air_effect_presets_db[preset_index] );
}


/** Cycle to the next Air Effect preset. Returns the new preset index.
  * @retval: new preset index
  */
uint8_t CycleAirEffectPresetDb( void )
{
  uint8_t next = (uint8_t)( air_effect_preset_idx + 1 );
  if( next >= AIR_EFFECT_PRESET_COUNT ) {
    next = 0;
  }
  SetAirEffectPresetDb( next );
  return air_effect_preset_idx;
}


