JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
/** Get the current Air Effect preset index
  * @retval: current preset index
  */
uint8_t GetAirEffectPresetIndex( void )
{
  return air_effect_preset_idx;
}


/** Get the number of available Air Effect presets
 * @retval: preset count
  */
uint8_t GetAirEffectPresetCount( void )
{
  return AIR_EFFECT_PRESET_COUNT;
}


/** Get the dB value of a preset (clamps to current if OOB)
  * @param: preset_index - Index of desired preset
  * @retval: dB value of the preset
  */
float GetAirEffectPresetDb( uint8_t preset_index )
{
  if( preset_index  >=  AIR_EFFECT_PRESET_COUNT ) {
    preset_index    =   air_effect_preset_idx;
  }
  return air_effect_presets_db[preset_index];
}
#else   // If Air Effect is disabled at compile time, provide stubs that do nothing or return defaults.
void SetAirEffectEnable( uint8_t enabled )
{
  (void)enabled;
  filter_cfg.enable_air_effect = 0;
}

uint8_t GetAirEffectEnable( void )
{
  return 0;
}

void SetAirEffectGainQ16( uint32_t gain_q16 )
{
  (void)gain_q16;
}

uint32_t GetAirEffectGainQ16( void )
{
  return 0;
}

void SetAirEffectGainDb( float db )
{
  (void)db;
}

float GetAirEffectGainDb( void )
{
  return 0.0f;
}

void SetAirEffectPresetDb( uint8_t preset_index )
{
  (void)preset_index;
  filter_cfg.enable_air_effect = 0;
}

uint8_t CycleAirEffectPresetDb( void )
{
  return 0;
}

uint8_t GetAirEffectPresetIndex( void )
{
  return 0;
}

uint8_t GetAirEffectPresetCount( void )
{
  return 0;
}

float GetAirEffectPresetDb( uint8_t preset_index )
{
  (void)preset_index;
  return 0.0f;
}
#endif


/** Set LPF makeup gain 
  * 
  * @brief Sets the makeup gain applied after the low-pass filter.
  * @param: gain - Floating-point gain value (0.1 to 2.0).
  * @retval: none
  */
void SetLpfMakeupGain8Bit( float gain )
{
  if( gain < 0.1f ) {
    gain = 0.1f;
  } else if( gain > 2.0f ) {
    gain = 2.0f;
  }
  uint32_t q16 = (uint32_t)( gain * 65536.0f + 0.5f );
  filter_cfg.lpf_makeup_gain_q16 = q16;
}


/** Set 16-bit LPF makeup gain
  *
  * @brief Sets the makeup gain applied after the 16-bit low-pass filter. Default is 1.0 (No gain), lower limit: 0.1, upper limit: 2.0.
  * @param: gain - Floating-point gain value (0.1 to 2.0).
  * @retval: none
  */
void SetLpfMakeupGain16Bit( float gain )
{
  if( gain < 0.1f ) {
    gain = 0.1f;
  } else if( gain > 2.0f ) {
    gain = 2.0f;
  }
  uint32_t q16 = (uint32_t)( gain * 65536.0f + 0.5f );
  filter_cfg.lpf_makeup_gain_16bit_q16 = q16;
}


/** Get 16-bit LPF makeup gain
  *
  * @brief Returns the makeup gain applied after the 16-bit low-pass filter.
  * @retval: float - Linear gain value
  */
float GetLpfMakeupGain16Bit( void )
{
  return (float)filter_cfg.lpf_makeup_gain_16bit_q16 / 65536.0f;
}


/**
 * @brief Calculate Q16 alpha for 16-bit LPF from -3dB cutoff and sample rate
 *
 * 1-pole IIR: alpha = exp(-2*pi*fc/fs)
 * For biquad, this is a good starting point for the smoothing factor.
 *
 * @param cutoff_hz - Desired -3dB cutoff frequency in Hz
 * @param sample_rate_hz - Sample rate in Hz
 * @return Q16 alpha coefficient for SetLpf16BitCustomAlpha
 */
uint16_t CalcLpf16BitAlphaFromCutoff( float cutoff_hz, float sample_rate_hz )
{
  /* Validate input parameters */
  if( cutoff_hz <= 0.0f || sample_rate_hz <= 0.0f ) { return 0; }

  float alpha_f = expf( -2.0f * 3.14159265359f * cutoff_hz / sample_rate_hz );
  if( alpha_f < 0.0f ) alpha_f = 0.0f;
  if( alpha_f > 0.99998f ) alpha_f = 0.99998f; // avoid overflow
  return (uint16_t)( alpha_f * 65536.0f + 0.5f );
}


/**
 * @brief Calculate Q16 alpha for 8-bit LPF from -3dB cutoff and sample rate
 *
 * 1-pole IIR: alpha = 1 - exp(-2*pi*fc/fs)
 *
 * @param cutoff_hz - Desired -3dB cutoff frequency in Hz
 * @param sample_rate_hz - Sample rate in Hz
 * @return Q16 alpha coefficient for SetLpf8BitCustomAlpha
 */
uint16_t CalcLpf8BitAlphaFromCutoff( float cutoff_hz, float sample_rate_hz )
{
  /* Validate input parameters */
  if( cutoff_hz <= 0.0f || sample_rate_hz <= 0.0f ) { return 0; }

  float alpha_f = 1.0f - expf( -2.0f * 3.14159265359f * cutoff_hz / sample_rate_hz );
  if( alpha_f < 0.0f ) alpha_f = 0.0f;
  if( alpha_f > 0.99998f ) alpha_f = 0.99998f; // avoid overflow
  return (uint16_t)( alpha_f * 65536.0f + 0.5f );
}


/**
 * @brief Get Q16 alpha for 16-bit LPF custom mode from -3dB cutoff and current sample rate
 * @param cutoff_hz - Desired -3dB cutoff frequency in Hz
 * @return Q16 alpha coefficient
 */
uint16_t GetLpf16BitCustomAlphaFromCutoff( float cutoff_hz )
{
  return CalcLpf16BitAlphaFromCutoff( cutoff_hz, (float)I2S_PlaybackSpeed );
}


/**
 * @brief Calculate a sample offset from time, sample rate, and mode
 * @param seconds - Desired offset in seconds (>= 0)
 * @param sample_rate_hz - Sample rate in Hz
 * @param mode - Playback mode: Mode_mono or Mode_stereo
 * @return Sample offset in interleaved samples
 */
uint32_t CalcSampleOffsetSamples( float seconds, uint32_t sample_rate_hz, PB_ModeTypeDef mode )
{
  if( seconds <= 0.0f || sample_rate_hz == 0U ) {
    return 0U;
  }

  float samples_f = seconds * (float)sample_rate_hz;
  if( mode == Mode_stereo ) {
    samples_f *= 2.0f;
  }

  if( samples_f > (float)UINT32_MAX ) {
    return UINT32_MAX;
  }

  return (uint32_t)( samples_f + 0.5f );
}


/** Set 16-bit LPF filter level
  * 
  * @brief Sets the aggressiveness level for the 16-bit biquad low-pass filter.
  * @param: level - Filter level (LPF_VerySoft, LPF_Soft, LPF_Medium, LPF_Firm, LPF_Aggressive).
  * @retval: none
  */
void SetLpf16BitLevel( LPF_Level level )
{
  filter_cfg.lpf_16bit_level = level;
  switch( level ) {
    case LPF_Off:
      filter_cfg.enable_16bit_biquad_lpf = 0;
      break;
    case LPF_VerySoft:
      lpf_16bit_alpha = LPF_16BIT_VERY_SOFT;
      break;
    case LPF_Soft:
      lpf_16bit_alpha = LPF_16BIT_SOFT;
      break;
    case LPF_Medium:
      lpf_16bit_alpha = LPF_16BIT_MEDIUM;
      break;
    case LPF_Firm:
      lpf_16bit_alpha = LPF_16BIT_FIRM;
      break;
    case LPF_Aggressive:
      lpf_16bit_alpha = LPF_16BIT_AGGRESSIVE;
      break;
    case LPF_Custom:
      lpf_16bit_alpha = filter_cfg.lpf_16bit_custom_alpha;
      break;
    default:
      lpf_16bit_alpha = LPF_16BIT_SOFT;
      filter_cfg.lpf_16bit_level = LPF_Soft;
      break;
  }

