JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
  if( level != LPF_Off ) {
      filter_cfg.enable_16bit_biquad_lpf = 1;
  }
}


/** Set a custom alpha for the 16-bit low-pass filter
  * @param: alpha - Custom alpha value in Q16 format (0-65535)
  * @retval: none
  */
void SetLpf16BitCustomAlpha( uint16_t alpha )
{
    filter_cfg.lpf_16bit_custom_alpha = alpha;
    if( filter_cfg.lpf_16bit_level == LPF_Custom ) {
      lpf_16bit_alpha = filter_cfg.lpf_16bit_custom_alpha;
    }
}


/** Convert fade time in seconds to sample count
  * 
  * @brief Helper function to convert fade time to samples with bounds checking.
  * @param: seconds - Fade time in seconds (will be clamped to 0.001-5.0 range).
  * @retval: uint32_t - Number of samples (minimum 1).
  */
static uint32_t FadeTimeToSamples( float seconds )
{
  if( seconds < 0.001f ) seconds = 0.001f;
  if( seconds > 5.0f ) seconds = 5.0f;
  uint32_t samples = (uint32_t) ( seconds * (float) I2S_PlaybackSpeed + 0.5f );
  return ( samples == 0 ) ? 1 : samples;
}


/** Fader state Setter
  *
  * @brief Sets whether to apply fades or not.
  * @param: fader_setting - 1 is faders enabled, 0 is disabled.
  * @retval: none
  */
void SetFadersEnabled( uint8_t fader_setting )
{
  faders_enabled = fader_setting ? 1 : 0;
}


/** Fader state getter
  *
  * @brief Gets the the fader enable state
  * @param: none
  * @retval: fader_enabled state.
  */
uint8_t GetFadersEnabled( void )
{
  return faders_enabled;
}


/** Set fade-in time in seconds
  * 
  * @brief Sets the fade-in duration based on the current playback speed.
  * @param: seconds - Fade-in time in seconds (0.001 to 5.0).
  * @retval: none
  */
void SetFadeInTime( float seconds )
{
  fadein_time_seconds = seconds;
  fadein_samples      = FadeTimeToSamples( seconds );
}


/** Get fade-in time in seconds
  * 
  * @brief Returns the current fade-in duration in seconds.
  * @retval: float - Fade-in time in seconds.
  */
float GetFadeInTime( void )
{
  return fadein_time_seconds;
}


/** Set fade-out time in seconds
  * 
  * @brief Sets the fade-out duration based on the current playback speed.
  * @param: seconds - Fade-out time in seconds (0.001 to 5.0).
  * @retval: none
  */
void SetFadeOutTime( float seconds )
{
  fadeout_time_seconds = seconds;
  fadeout_samples      = FadeTimeToSamples( seconds );
}


/** Get fade-out time in seconds
  * 
  * @brief Returns the current fade-out duration in seconds.
  * @retval: float - Fade-out time in seconds.
  */
float GetFadeOutTime( void )
{
  return fadeout_time_seconds;
}


/** Set pause fade-out time in seconds
  * 
  * @brief Sets the pause fade-out duration based on the current playback speed.
  * @param: seconds - Pause fade-out time in seconds (0.001 to 5.0).
  * @retval: none
  */
void SetPauseFadeTime( float seconds )
{
  pause_fadeout_time_seconds = seconds;
  pause_fadeout_samples      = FadeTimeToSamples( seconds );
}


/** Get pause fade-out time in seconds
  * 
  * @brief Returns the current pause fade-out duration in seconds.
  * @retval: float - Pause fade-out time in seconds.
  */
float GetPauseFadeTime( void )
{
  return pause_fadeout_time_seconds;
}


/** Set resume fade-in time in seconds
  * 
  * @brief Sets the resume fade-in duration based on the current playback speed.
  * @param: seconds - Resume fade-in time in seconds (0.001 to 5.0).
  * @retval: none
  */
void SetResumeFadeTime( float seconds )
{
  pause_fadein_time_seconds = seconds;
  pause_fadein_samples      = FadeTimeToSamples( seconds );
}


/** Get resume fade-in time in seconds
  * 
  * @brief Returns the current resume fade-in duration in seconds.
  * @retval: float - Resume fade-in time in seconds.
  */
float GetResumeFadeTime( void )
{
  return pause_fadein_time_seconds;
}


/** Get the current playback speed
  * 
  * @param: none
  * @retval: uint32_t - Current playback speed in Hz
  */
uint32_t GetPlaybackSpeed( void )
{
    return I2S_PlaybackSpeed;
}


/** Get the number of source samples already played
  *
  * @retval: uint32_t - Number of interleaved source samples already consumed by DMA
  */
uint32_t GetPlaybackProgressSamples( void )
{
  return playback_samples_played;
}


/** Get playback progress as a percentage
  *
  * @retval: float - Playback progress in the range 0.0f to 100.0f
  */
float GetPlaybackProgressPercent( void )
{
  uint32_t total_samples  = playback_total_samples;
  uint32_t played_samples = playback_samples_played;

  if( total_samples == 0U ) {
    return 0.0f;
  }

  if( played_samples > total_samples ) {
    played_samples = total_samples;
  }

  return ( (float)played_samples * 100.0f ) / (float)total_samples;
}


/* ===== DSP Filter Functions ===== */

/* TPDF Dithering - Linear Congruential Generator (LCG) constants */
#define DITHER_LCG_MULTIPLIER       1103515245U   /* Standard POSIX LCG multiplier */
#define DITHER_LCG_INCREMENT        12345U        /* Standard POSIX LCG increment */
#define DITHER_RANDOM_BITS_SHIFT    16            /* Extract upper 16 bits of LCG state */
#define DITHER_RANDOM_MASK          0xFF          /* Mask to get 8-bit random value */
#define DITHER_SCALE_SHIFT          6             /* Scale dither from [-256, 256] to [-4, 4] */


/** Apply TPDF dithering during 8-bit to 16-bit conversion with cubic interpolation
  * 
  * Uses a fast Linear Congruential Generator for random noise generation.
  * 
  * @param: sample8 - Unsigned 8-bit audio sample
  * @retval: int16_t - Signed 16-bit dithered audio sample
  */
static int16_t Apply8BitDithering( uint8_t sample8 )
{
  // Convert unsigned 8-bit (0..255) to signed 16-bit
  int16_t sample16  = (int16_t)( sample8 - SAMPLE8_MIDPOINT ) << 8;
  
  // Generate TPDF (Triangular Probability Density Function) dither
  dither_state      = dither_state * DITHER_LCG_MULTIPLIER + DITHER_LCG_INCREMENT;
  int32_t rand1     = ( dither_state >> DITHER_RANDOM_BITS_SHIFT ) & DITHER_RANDOM_MASK;
  
  dither_state      = dither_state * DITHER_LCG_MULTIPLIER + DITHER_LCG_INCREMENT;
  int32_t rand2     = ( dither_state >> DITHER_RANDOM_BITS_SHIFT ) & DITHER_RANDOM_MASK;
  
  int16_t dither    = (int16_t)( ( rand1 - rand2 ) >> DITHER_SCALE_SHIFT );
  
  return sample16 + dither;
}


/** Apply low-pass biquad filter to 8-bit sample
  * 
  * @param: sample - Signed 16-bit audio sample (from 8-bit input)
  * @param: y2 - Pointer to previous output samples
  * @retval: int16_t - Filtered signed 16-bit audio sample
  */
static int16_t PUT_IN_FASTMEM ApplyLowPassFilter8Bit( int16_t sample, volatile int32_t *y1 )
{
  int32_t alpha = lpf_8bit_alpha;
  int32_t one_minus_alpha = (int32_t)( Q16_SCALE - alpha );
  int32_t output = ( ( alpha * sample) >> 16 ) + 
                   ( ( one_minus_alpha * ( *y1 ) ) >> 16 );
  // Apply makeup gain
  int64_t output64 = ( (int64_t)output * (int64_t)filter_cfg.lpf_makeup_gain_q16 ) >> 16;
  // Clamp to valid 16-bit range
  if( output64 > AUDIO_INT16_MAX ) output64 = AUDIO_INT16_MAX;
  if( output64 < AUDIO_INT16_MIN ) output64 = AUDIO_INT16_MIN;
  *y1 = (int32_t)output64;
  return (int16_t)output64;
}


/** Apply fade-in effect to audio sample
  * 
  * @param: sample - Signed 16-bit audio sample
  * @retval: int16_t - Faded-in signed 16-bit audio sample
  */
static int16_t PUT_IN_FASTMEM ApplyFadeIn( int16_t sample ) 
{
  if( fadein_samples_remaining > 0 ) {
    /* Calculate progress as a ratio of how much fade time has elapsed.
       The initial value of fadein_samples_remaining is our duration.
       We calculate fade_mult based on the ratio of remaining to initial. */
    
