JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
  return (int16_t)output;
}
#endif


/** Apply full filter chain to 16-bit sample
  * 
  * @param: sample - Signed 16-bit audio sample
  * @param: channel_id - CHANNEL_LEFT or CHANNEL_RIGHT
  * @retval: int16_t - Processed signed 16-bit audio sample
  */
static int16_t PUT_IN_FASTMEM ApplyFilterChain16Bit( int16_t sample, AudioChannelId channel_id )
{
  AudioFilterChannelState *channel = GetChannelState( channel_id );
  if( filter_cfg.enable_16bit_biquad_lpf ) {
    sample = ApplyLowPassFilter16Bit( sample, &channel->lpf16_x1, &channel->lpf16_x2,
                                      &channel->lpf16_y1, &channel->lpf16_y2 );
  }
  
  return ApplyPostFilters( sample, channel_id );
}


/** Apply full filter chain to 8-bit sample
  * 
  * @param: sample - Signed 16-bit audio sample
  * @param: channel_id - CHANNEL_LEFT or CHANNEL_RIGHT
  * @retval: int16_t - Processed signed 16-bit audio sample
  */
static int16_t PUT_IN_FASTMEM ApplyFilterChain8Bit( int16_t sample, AudioChannelId channel_id )
{
  AudioFilterChannelState *channel = GetChannelState( channel_id );
  if( filter_cfg.enable_8bit_lpf ) {
    sample = ApplyLowPassFilter8Bit( sample, &channel->lpf8_y1 );
  }
  
  return ApplyPostFilters( sample, channel_id );
}


/** Apply post-LPF filters common to 8-bit and 16-bit chains
  *
  * @param: sample - Signed 16-bit audio sample
  * @param: channel_id - CHANNEL_LEFT or CHANNEL_RIGHT
  * @retval: int16_t - Processed signed 16-bit audio sample
  */
static inline int16_t PUT_IN_FASTMEM ApplyPostFilters( int16_t sample, AudioChannelId channel_id )
{
  AudioFilterChannelState *channel = GetChannelState( channel_id );
  volatile int32_t *dc_prev_input  = &channel->dc_prev_input;
  volatile int32_t *dc_prev_output = &channel->dc_prev_output;

  if( filter_cfg.enable_soft_dc_filter_16bit ) {
    sample = ApplySoftDCFilter16Bit( sample, dc_prev_input, dc_prev_output );
  } else {
    sample = ApplyDCBlockingFilter( sample, dc_prev_input, dc_prev_output );
  }
  
#if AUDIO_ENGINE_ENABLE_AIR_EFFECT
  if( filter_cfg.enable_air_effect ) {
    sample = ApplyAirEffect( sample, &channel->air_x1, &channel->air_y1 );
  }
#endif
  
  if( filter_cfg.enable_noise_gate ) {
    sample = ApplyNoiseGate( sample );
  }
  
  if( filter_cfg.enable_soft_clipping ) {
    sample = ApplySoftClipping( sample );
  }
  
  return sample;
}


/** Reset playback state variables to idle condition.
  * 
  * Resets mode, pointers, and counters.
  */
static void ResetPlaybackState( void ) {
  pb_mode                       = 0;
  pb_p8_ptr                     = NULL;
  pb_end8_ptr                   = NULL;
  pb_p16_ptr                    = NULL;
  pb_end16_ptr                  = NULL;
  pb_padpcm_ptr                 = NULL;
  pb_endadpcm_ptr               = NULL;
  paused_sample_ptr             = NULL;
  samples_remaining             = 0;
  fadeout_samples_remaining     = 0;
  fadein_samples_remaining      = 0;
  paused_samples_remaining      = 0;
  half_to_fill                  = FIRST;
  playback_total_samples        = 0;
  playback_samples_played       = 0;
  dma_half_sample_counts[ FIRST ] = 0U;
  dma_half_sample_counts[ SECOND ] = 0U;
  stop_requested                = 0;
  playback_end_callback_called  = 0;
  adpcm_predictor_l             = 0;
  adpcm_predictor_r             = 0;
  adpcm_step_index_l            = 0;
  adpcm_step_index_r            = 0;
}


/** Prepare engine and transport state for a deterministic playback start.
  *
  * Ensures DMA is halted, playback state is reset, filter memory is cleared,
  * and the output buffer is filled with silence before prefill begins.
  */
static inline void PrepareForNewPlayback( void )
{
  dma_interrupt_disable( DMA0, DMA_CH4, DMA_INT_HTF | DMA_INT_FTF );
  spi_dma_disable( PROJECT_SPI, SPI_DMA_TRANSMIT );   // FINDME
  i2s_disable( PROJECT_SPI );
  ResetPlaybackState();
  ResetAllFilterState();
  MIDPOINT_FILL_BUFFER();
  pb_state = PB_Idle;
}


/* ===== State Accessors ===== */

/** Get current playback state
  * 
  * @param: none
  * @retval: PB_StatusTypeDef - Current playback state (PB_Idle, PB_Playing, PB_Paused)
  */
PB_StatusTypeDef GetPlaybackState( void )
{
  return pb_state;
}


/** Set current playback state
  * 
  * @param: state - Desired playback state (PB_Idle, PB_Playing, PB_Paused)
  * @retval: none
  */
void SetPlaybackState( PB_StatusTypeDef state )
{
  pb_state = state;
}


/** DAC Control Setter
 *
 * @param: enable - 1 to enable DAC output, 0 to disable
 * @retval: none
 */
 void SetDAC_Control( uint8_t state )
 {
  dac_power_control = state;
 }


/** DAC Control Getter *
 * @param: none
 * @retval: uint8_t - Current DAC control state (1 for enabled, 0 for disabled)
 */
 uint8_t GetDAC_Control( void )
 {
  return dac_power_control;
 }
 

/** Get which half of the buffer to fill
  * 
  * @param: none
  * @retval: uint8_t - FIRST or SECOND half indicator
  */
uint8_t GetHalfToFill( void )
{
  return half_to_fill;
}


/** Set which half of the buffer to fill
  * 
  * @param: half - FIRST or SECOND half indicator
  * @retval: none
  */
void SetHalfToFill( uint8_t half )
{
  half_to_fill = half;
}


/** Set current playback speed
  * 
  * @brief Sets the playback speed for sample processing.  Not to be use mid-playback.
  * @param: speed - Desired playback speed in Hz
  * @retval: none
  */
void SetPlaybackSpeed( uint32_t speed )
{
  I2S_PlaybackSpeed = speed;
}


/* ============================================================================
 * DMA Callbacks
 * ============================================================================
 */

/* Static inline helpers */

/** Helper to recalculate fade sample counts based on current fade times
  *
  * Should be called whenever fade times or playback speed are changed to ensure fade
  * durations remain consistent.
  */
static inline void RecalculateFadeSamples( void )
{
  fadein_samples        = FadeTimeToSamples( fadein_time_seconds );
  fadeout_samples       = FadeTimeToSamples( fadeout_time_seconds );
  pause_fadeout_samples = FadeTimeToSamples( pause_fadeout_time_seconds );
  pause_fadein_samples  = FadeTimeToSamples( pause_fadein_time_seconds );
}


