JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
/** Clean up after playback ends
  *
  * Common cleanup logic for when playback finishes naturally or when a stop request is processed.
  * Resets state, fills buffer with silence, halts DMA, and calls the playback
  * end callback if it hasn't been called already.
  */
static inline void EndPlaybackCleanup( void )
{
  pb_state = PB_Idle;
  MIDPOINT_FILL_BUFFER();
  StopDmaAndResetPlaybackState( 1U );
  if( !playback_end_callback_called ) {
    playback_end_callback_called = 1;
    AudioEngine_OnPlaybackEnd();
    if( dac_power_control == true ) {
      AudioEngine_DACSwitch( 0 );
    }
  }
}


/** Stop DMA transmission and optionally reset playback state
  *
  * @param: reset_state - Non-zero to reset playback state
  * @retval: none
  */
static inline void StopDmaAndResetPlaybackState( uint8_t reset_state )
{
  dma_interrupt_disable( DMA0, DMA_CH4, DMA_INT_HTF | DMA_INT_FTF );
  spi_dma_disable( PROJECT_SPI, SPI_DMA_TRANSMIT );   // FINDME
  i2s_disable( PROJECT_SPI );
  if( reset_state ) {
    ResetPlaybackState();
  }
}


/** Retire the samples that were just played from a completed DMA half
  *
  * @param: completed_half - FIRST or SECOND
  * @retval: none
  */
static inline void RetireCompletedDmaHalf( uint8_t completed_half )
{
  uint32_t completed_samples = dma_half_sample_counts[ completed_half ];
  uint32_t remaining_samples = ( playback_total_samples > playback_samples_played ) ?
                               ( playback_total_samples - playback_samples_played ) : 0U;

  if( completed_samples > remaining_samples ) {
    completed_samples = remaining_samples;
  }

  playback_samples_played += completed_samples;
  dma_half_sample_counts[ completed_half ] = 0U;
}


/** Immediate stop of playback, halting DMA and resetting state without waiting for buffer to drain 
  *
  * Use when stopping from paused state or when an immediate halt is required.  Will not apply fade-out.
  */
static inline void StopImmediate( void )
{
  pb_state = PB_Idle;
  StopDmaAndResetPlaybackState( 1U );

  MIDPOINT_FILL_BUFFER();

  if( !playback_end_callback_called ) {
    playback_end_callback_called = 1;
    AudioEngine_OnPlaybackEnd();

    if( dac_power_control == true ) {
      AudioEngine_DACSwitch( DAC_OFF );
    }
  }
}


/** Common DMA callback processing logic
  *
  * Helper function to handle buffer refilling for both half-complete and 
  * complete DMA callbacks. Eliminates duplication between the two callbacks.
  *
  * @param: which_half - Which half of buffer to fill (FIRST or SECOND)
  * @retval: none
  */
static DMA_CALLBACK_INLINE void ProcessDMACallback( uint8_t which_half )
{
  if( which_half == FIRST ) {
    dma_interrupt_flag_clear( DMA0, DMA_CH4, DMA_INT_FLAG_HTF );
  } else {
    dma_interrupt_flag_clear( DMA0, DMA_CH4, DMA_INT_FLAG_FTF );
  }
  
  RetireCompletedDmaHalf( which_half );
  /* Handle pending stop request at the beginning of DMA callback (safest place to modify state) */
  if( stop_requested && pb_state != PB_Idle ) {
    /* Only handle stop if we're in a playable state */
    if( pb_state == PB_Paused ) {
      /* If paused, stop immediately */
      StopImmediate();
      return;
    }
    
    /* For playing states, initiate fade-out by shortening the sample duration */
    if( pb_state != PB_Pausing ) {
      /* If not already pausing, set state to pausing and prepare for fade */
      pb_state = PB_Pausing;
      if( pb_mode == 16 ) {
        ptrdiff_t remaining = pb_end16_ptr - pb_p16_ptr;
        if( remaining <= 0 ) {
          EndPlaybackCleanup();
          return;
        }
        if( (uint32_t)remaining > fadeout_samples ) {
          pb_end16_ptr = pb_p16_ptr + fadeout_samples;
        }
      } else if( pb_mode == 8 ) {
        ptrdiff_t remaining = pb_end8_ptr - pb_p8_ptr;
        if( remaining <= 0 ) {
          EndPlaybackCleanup();
          return;
        }
        if( (uint32_t)remaining > fadeout_samples ) {
          pb_end8_ptr = pb_p8_ptr + fadeout_samples;
        }
      } else if( pb_mode == PB_MODE_IMA_ADPCM ) {
        ptrdiff_t remaining_bytes = pb_endadpcm_ptr - pb_padpcm_ptr;
        uint32_t remaining_samples = ( remaining_bytes > 0 ) ? ( (uint32_t)remaining_bytes << 1 ) : 0U;
        if( remaining_samples == 0U ) {
          EndPlaybackCleanup();
          return;
        }
        if( remaining_samples > fadeout_samples ) {
          uint32_t keep_bytes = ( fadeout_samples + 1U ) >> 1;
          pb_endadpcm_ptr = pb_padpcm_ptr + keep_bytes;
        }
      }
    }
  }
  
  /* If fully paused (fadeout already complete), fill buffer with silence */
  if( pb_state == PB_Paused ) {
    MIDPOINT_FILL_BUFFER();
    dma_half_sample_counts[ which_half ] = 0U;
    return;
  }
  
  /* Special case: if pausing and fadeout nearly complete, skip processing and fill with silence */
  if( pb_state == PB_Pausing && fadeout_samples_remaining <= HALFCHUNK_SZ ) {
    MIDPOINT_FILL_BUFFER();
    dma_half_sample_counts[ which_half ] = 0U;
    pb_state = PB_Paused;
    return;
  }

  half_to_fill = which_half;

  if( pb_mode == 16 || pb_mode == 8 || pb_mode == PB_MODE_IMA_ADPCM ) {
    if( ( pb_mode == 16 && pb_p16_ptr >= pb_end16_ptr ) ||
        ( pb_mode == 8  && pb_p8_ptr  >= pb_end8_ptr  ) ||
        ( pb_mode == PB_MODE_IMA_ADPCM && pb_padpcm_ptr >= pb_endadpcm_ptr )
      ) {
      EndPlaybackCleanup();   // Cleanup and stop playback if we've reached the end of the sample data.
      return;
    }
    /* Only one chunk process will be used because of short-circuit evaluation. */
    if( ( pb_mode == 16 && ProcessNextWaveChunk( (int16_t *) pb_p16_ptr ) != PB_Playing ) ||
        ( pb_mode == 8  && ProcessNextWaveChunk_8_bit( (uint8_t *) pb_p8_ptr ) != PB_Playing ) ||
        ( pb_mode == PB_MODE_IMA_ADPCM && ProcessNextWaveChunk_ADPCM( (uint8_t *) pb_padpcm_ptr ) != PB_Playing ) ) {
      return;
    }
  } else {
    MIDPOINT_FILL_BUFFER();
    return;
  }
  
  AdvanceSamplePointer();
}


/** Handle refilling the first half of the buffer whilst the second half is playing
  *
  * params: hi2s_p I2S port handle.
  * retval: none.
  *
  * NOTE: Also shuts down the playback when the recording is done.
  *
  */
void DMA0_Channel4_IRQHandler( void )
{
  FlagStatus dma_done, dma_half_done;

  dma_done        = dma_flag_get( DMA0, DMA_CH4, DMA_FLAG_FTF );
  dma_half_done   = dma_flag_get( DMA0, DMA_CH4, DMA_FLAG_HTF );


  if( dma_half_done == SET ) {
    ProcessDMACallback( FIRST );
  }
  else if( dma_done == SET ) {
    ProcessDMACallback( SECOND );
  }
}


/** Advance the sample pointer based on playback mode and advance value
  *
  * params: none.
  * retval: none.
  *
  */
void AdvanceSamplePointer( void )
{
  if( pb_mode == 16 ) {  // Advance the 16-bit sample pointer
    pb_p16_ptr += p_advance;
    if( pb_p16_ptr >= pb_end16_ptr ) {
      StopImmediate();
      pb_state = PB_Idle;
      return;
    }
  }
  else if( pb_mode == 8 ) {  // Or advance the 8-bit sample pointer
    pb_p8_ptr += p_advance;
    if( pb_p8_ptr >= pb_end8_ptr ) {
      StopImmediate();
      pb_state = PB_Idle;
      return;
    }
  }
  else if( pb_mode == PB_MODE_IMA_ADPCM ) {
    pb_padpcm_ptr += p_advance;
    if( pb_padpcm_ptr >= pb_endadpcm_ptr ) {
      StopImmediate();
      pb_state = PB_Idle;
      return;
    }
  }
}


/* ============================================================================
 * Chunk Processing
 * ============================================================================
 */

/** Transfers a chunk of 16-bit samples to the DMA playback buffer and processes them
  *
  * It also processes for stereo mode
  *
  * @param: int16_t* chunk_p.  The start of the chunk to transfer.
  * @retval: none.
  *
  */
PB_StatusTypeDef ProcessNextWaveChunk( int16_t * chunk_p )
{
  int16_t *input, *output;
  int16_t leftsample, rightsample;
  uint16_t current_volume;
  uint32_t chunk_source_samples = 0U;

  if( chunk_p == NULL ) {   // Sanity check
    return PB_Error;
  }

  vol_input = AudioEngine_ReadVolume();

  input   = chunk_p;      // Source sample pointer
  output  = ( half_to_fill == SECOND ) ? ( pb_buffer + CHUNK_SZ ) : pb_buffer;

  // Transfer mono audio (scaled for volume) into the stereo buffer.
  // This is done both to eliminate the need for a second resistor
  // and also because the MAX983567A expects stereo audio data, but we only
  // have one speaker.
  //
  for( uint16_t i = 0; i < HALFCHUNK_SZ; i++ )
  {
    current_volume = AudioEngine_ReadVolume();
    vol_input = current_volume;

    if( (uint16_t *) input >=  pb_end16_ptr ) {                                   // Check for end of sample data
      leftsample = SAMPLE16_MIDPOINT;                                             // Pad with silence if at end 
    }
    else {
      chunk_source_samples++;
      leftsample = ApplyVolumeSetting( *input, current_volume );                  // Apply volume setting
      if( filter_cfg.enable_filter_chain_16bit == 1 ) {
        leftsample = ApplyFilterChain16Bit( leftsample, CHANNEL_LEFT );            // Apply complete filter chain
      }
      if( faders_enabled ) {
        leftsample = ApplyFadeIn( leftsample );
        leftsample = ApplyFadeOut( leftsample );
      }
    }
    input++;

    if( channels == Mode_mono ) { rightsample = leftsample; }                     // Right channel is the same as left.
    else {
      if( (uint16_t *) input >=  pb_end16_ptr ) {                                 // Check for end of sample data
        rightsample = SAMPLE16_MIDPOINT;                                          // Pad with silence if at end
      }
      else { 
        chunk_source_samples++;
        rightsample = ApplyVolumeSetting( *input, current_volume );               // Right channel
        if( filter_cfg.enable_filter_chain_16bit == 1 ) {
          rightsample = ApplyFilterChain16Bit( rightsample, CHANNEL_RIGHT );       // Apply complete filter chain
        }
        if( faders_enabled ) {
          rightsample = ApplyFadeIn( rightsample );
          rightsample = ApplyFadeOut( rightsample );
        }
      }   // End of right channel processing
      input++;
    }
    *output = leftsample;  output++;                                              // Write samples to output buffer
    *output = rightsample; output++;
    
    // Update fade counters based on samples processed
    uint32_t samples_processed = ( channels == Mode_stereo ) ? 2 : 1;

