JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
    UpdateFadeCounters( samples_processed );
  }
  dma_half_sample_counts[ half_to_fill ] = chunk_source_samples;
  return PB_Playing;;
}


/** Transfers a chunk of 8-bit samples to the DMA playback buffer
  *
  * It also processes for stereo mode
  *
  * @param: uint8_t* chunk_p.  The start of the chunk to transfer.
  * @retval: none.
  *
  */
PB_StatusTypeDef ProcessNextWaveChunk_8_bit( uint8_t * chunk_p )
{
  uint8_t *input;
  int16_t *output;
  int16_t leftsample, rightsample;
  uint16_t current_volume;
  uint32_t chunk_source_samples = 0U;

  if( chunk_p == NULL ) {   // Sanity check
    return PB_Error;
  }

  vol_input = AudioEngine_ReadVolume();

  input   = chunk_p;                                                        // Source sample pointer
  output  = ( half_to_fill == SECOND ) ? ( pb_buffer + CHUNK_SZ ) : pb_buffer;

  // Transfer mono audio (scaled for volume) into the stereo buffer.
  // This is done both to eliminate the need for a second resistor
  // and also because the MAX983567A expects stereo audio data, but we only
  // have one speaker.

  for( uint16_t i = 0; i < HALFCHUNK_SZ; i++ )
  {
    current_volume = AudioEngine_ReadVolume();
    vol_input = current_volume;

    if( (uint8_t *) input >=  pb_end8_ptr ) {                               // Check for end of sample data
      leftsample = SAMPLE16_MIDPOINT;                                       // Pad with silence if at end
    }
    else {
      chunk_source_samples++;
      /* Convert unsigned 8-bit (0..255) -> signed 16-bit with dithering */
      uint8_t sample8 = *input;
      leftsample = Apply8BitDithering( sample8 );                           // Left channel with dithering
      leftsample = ApplyVolumeSetting( leftsample, current_volume );
      if( filter_cfg.enable_filter_chain_8bit == 1 ) {
        leftsample = ApplyFilterChain8Bit( leftsample, CHANNEL_LEFT );       // Apply complete filter chain
      }
      if( faders_enabled ) {
        leftsample = ApplyFadeIn( leftsample );
        leftsample = ApplyFadeOut( leftsample );
      }
    }
    input++;

    if( channels == Mode_mono ) { rightsample = leftsample; }               // Right channel is the same as left.
    else {    
      if( (uint8_t *) input >=  pb_end8_ptr ) {                             // Check for end of sample data
        rightsample = SAMPLE16_MIDPOINT;                                    // Pad with silence if at end
      }
      else {               
        chunk_source_samples++;
        /* Convert unsigned 8-bit (0..255) -> signed 16-bit with dithering */
        uint8_t sample8 = *input;
        rightsample = Apply8BitDithering( sample8 );                        // Right channel with dithering
        rightsample = ApplyVolumeSetting( rightsample, current_volume );
        if( filter_cfg.enable_filter_chain_8bit == 1 ) {
          rightsample = ApplyFilterChain8Bit( rightsample, CHANNEL_RIGHT );   // Apply complete filter chain
        }
        if( faders_enabled ) {
          rightsample = ApplyFadeIn( rightsample );
          rightsample = ApplyFadeOut( rightsample );
        }
      }
      input++;
    }
    *output = leftsample;  output++;                                        // Transfer samples to output buffer
    *output = rightsample; output++;
    
    // Update fade counters based on samples processed
    uint32_t samples_processed = ( channels == Mode_stereo ) ? 2 : 1;

    UpdateFadeCounters( samples_processed );
  }
  dma_half_sample_counts[ half_to_fill ] = chunk_source_samples;
  return PB_Playing;
}


/** Transfers a chunk of IMA ADPCM data to the DMA playback buffer
  *
  * Decodes 4-bit IMA ADPCM nibbles into signed 16-bit PCM and then applies
  * the existing volume/filter/fade pipeline.
  *
  * Mode expectations:
  * - Mode_mono_ADPCM: sequential nibbles (low then high) for mono source.
  * - Mode_stereo_ADPCM: each byte packs one stereo frame (low=left, high=right).
  */
static PB_StatusTypeDef ProcessNextWaveChunk_ADPCM( uint8_t *chunk_p )
{
  uint8_t *input;
  int16_t *output;
  int16_t leftsample, rightsample;
  uint16_t current_volume;
  uint32_t chunk_source_samples = 0U;
  uint32_t available_bytes;

  if( chunk_p == NULL ) {
    return PB_Error;
  }

  input = chunk_p;
  output = ( half_to_fill == SECOND ) ? ( pb_buffer + CHUNK_SZ ) : pb_buffer;
  available_bytes = ( pb_endadpcm_ptr > input ) ? (uint32_t)( pb_endadpcm_ptr - input ) : 0U;

  for( uint16_t i = 0; i < HALFCHUNK_SZ; i++ ) {
    current_volume = AudioEngine_ReadVolume();
    vol_input = current_volume;

    if( channels == Mode_mono_ADPCM ) {
      uint32_t byte_index = (uint32_t)i >> 1;

      if( byte_index < available_bytes ) {
        uint8_t packed = input[ byte_index ];
        uint8_t nibble = ( i & 1U ) ? ( packed >> 4 ) : ( packed & 0x0FU );
        chunk_source_samples++;
        leftsample = DecodeImaAdpcmNibble( nibble, &adpcm_predictor_l, &adpcm_step_index_l );
        leftsample = ApplyVolumeSetting( leftsample, current_volume );
        if( filter_cfg.enable_filter_chain_16bit == 1 ) {
          leftsample = ApplyFilterChain16Bit( leftsample, CHANNEL_LEFT );
        }
        if( faders_enabled ) {
          leftsample = ApplyFadeIn( leftsample );
          leftsample = ApplyFadeOut( leftsample );
        }
      } else {
        leftsample = SAMPLE16_MIDPOINT;
      }

      rightsample = leftsample;
    }
    else {
      uint32_t byte_index = (uint32_t)i;

      if( byte_index < available_bytes ) {
        uint8_t packed = input[ byte_index ];
        uint8_t nibble_l = packed & 0x0FU;
        uint8_t nibble_r = ( packed >> 4 ) & 0x0FU;

        chunk_source_samples += 2U;
        leftsample = DecodeImaAdpcmNibble( nibble_l, &adpcm_predictor_l, &adpcm_step_index_l );
        rightsample = DecodeImaAdpcmNibble( nibble_r, &adpcm_predictor_r, &adpcm_step_index_r );

        leftsample = ApplyVolumeSetting( leftsample, current_volume );
        rightsample = ApplyVolumeSetting( rightsample, current_volume );

        if( filter_cfg.enable_filter_chain_16bit == 1 ) {
          leftsample = ApplyFilterChain16Bit( leftsample, CHANNEL_LEFT );
          rightsample = ApplyFilterChain16Bit( rightsample, CHANNEL_RIGHT );
        }

        if( faders_enabled ) {
          leftsample = ApplyFadeIn( leftsample );
          leftsample = ApplyFadeOut( leftsample );
          rightsample = ApplyFadeIn( rightsample );
          rightsample = ApplyFadeOut( rightsample );
        }
      } else {
        leftsample = SAMPLE16_MIDPOINT;
        rightsample = SAMPLE16_MIDPOINT;
      }
    }

    *output++ = leftsample;
    *output++ = rightsample;

    UpdateFadeCounters( IsStereoPlaybackMode( channels ) ? 2U : 1U );
  }

  dma_half_sample_counts[ half_to_fill ] = chunk_source_samples;
  return PB_Playing;
}


/* ============================================================================
 * Playback Control Functions
 * ============================================================================
 */

