JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
/** Initiates playback of your specified sample
  *
  * @param: const void* sample_to_play.  Pointer to audio sample data (8-bit or 16-bit).
  * @param: uint32_t sample_set_sz.  Total samples (all channels combined).
  * @param: uint32_t playback_speed.  This is the sample rate.
  * @param: uint8_t sample depth.  This should be 8 or 16 bits.
  * @param: PB_ModeTypeDef mode.  Mono or stereo playback.
  * @retval: PB_StatusTypeDef.  Indicates success or failure.
  *
  */
PB_StatusTypeDef PlaySample (  
                              const void *sample_to_play, 
                              uint32_t sample_set_sz, 
                              uint32_t playback_speed, 
                              uint8_t sample_depth, 
                              PB_ModeTypeDef mode 
                            ) 
{
  uint8_t adpcm_mode  = IsAdpcmPlaybackMode( mode );
  uint8_t stereo_mode = IsStereoPlaybackMode( mode );

  // Parameter sanity checks
  //
  if( ( !adpcm_mode && sample_depth != 16 && sample_depth != 8 ) ||
      ( mode != Mode_mono && mode != Mode_stereo && mode != Mode_mono_ADPCM && mode != Mode_stereo_ADPCM ) ||
        sample_set_sz   == 0                      ||
        sample_to_play  == NULL
    ) { return PB_Error; }

  // Ensure volume callback is initialized before starting playback
  if( AudioEngine_ReadVolume == NULL ) {
    return PB_Error;
  }

  // Set low-pass filter alpha coefficient based on filter config
  lpf_8bit_alpha = GetLpf8BitAlpha( filter_cfg.lpf_8bit_level );
  
  if( adpcm_mode ) {
    p_advance = stereo_mode ? HALFCHUNK_SZ : ( HALFCHUNK_SZ / 2U );
    channels = mode;
  } else if( stereo_mode ) {
    p_advance = CHUNK_SZ;                                 // Two channels worth of samples per chunk
    channels  = Mode_stereo;
  } else {
    p_advance  = HALFCHUNK_SZ;
    channels   = Mode_mono;
  }

  I2S_PlaybackSpeed = playback_speed;                     // Set our playback speed.
  
  // Recalculate fade sample counts based on new playback speed
  RecalculateFadeSamples();
  
  if( AudioEngine_I2SInit ) { AudioEngine_I2SInit( playback_speed ); }  // Initialize I2S peripheral with our chosen sample rate.

  dma_interrupt_disable( DMA0, DMA_CH4, DMA_INT_HTF | DMA_INT_FTF );    // Stop playback and IRQ generation.
  i2s_disable( PROJECT_SPI );

// Always start from a known-clean state before filling the next playback buffer.
  PrepareForNewPlayback();
  
  // Warm up 16-bit biquad filter state from first sample to avoid startup transient
  if( !adpcm_mode && sample_depth == 16 && filter_cfg.enable_16bit_biquad_lpf ) {
    int16_t first_sample = *( (int16_t *)sample_to_play );
    WarmupBiquadFilter16Bit( first_sample );
  }
  
  if( adpcm_mode ) {
    pb_padpcm_ptr   = (uint8_t *) sample_to_play;
    pb_endadpcm_ptr = pb_padpcm_ptr + sample_set_sz;
    pb_mode = PB_MODE_IMA_ADPCM;
  }
  else if( sample_depth == 16 ) {                  // For 16-bit, initialize 16-bit sample playback pointers
    pb_p16_ptr    = (uint16_t *) sample_to_play;
    pb_end16_ptr  = pb_p16_ptr + sample_set_sz;
    pb_mode   = 16;
  }
  else if( sample_depth == 8 ) {              // For 8-bit, initialize 8-bit sample playback pointers
    pb_p8_ptr     = (uint8_t *) sample_to_play;
    pb_end8_ptr   = pb_p8_ptr + sample_set_sz;
    pb_mode   = 8;
  }

  uint32_t total_source_samples = adpcm_mode ?
                                  ( ( sample_set_sz > ( UINT32_MAX >> 1 ) ) ? UINT32_MAX : ( sample_set_sz << 1 ) ) :
                                  sample_set_sz;

  // Initialize fade counters
  playback_total_samples      = total_source_samples;
  playback_samples_played     = 0U;
  dma_half_sample_counts[ FIRST ] = 0U;
  dma_half_sample_counts[ SECOND ] = 0U;
  samples_remaining         = total_source_samples;  // Track position in source samples
  fadeout_samples_remaining = 0;              // Pause fadeout duration (set when pause is called)
  fadein_samples_remaining  = fadein_samples;
  
  // Pre-fill the buffer with processed samples before starting DMA
  // This ensures the fade-in is applied from the very first sample that plays
  half_to_fill = FIRST;
  if( pb_mode == 16 ) {
    if( ProcessNextWaveChunk( (int16_t *) pb_p16_ptr ) != PB_Playing ) { return PB_Error; }
    pb_p16_ptr += p_advance;

    half_to_fill = SECOND;
    if( ProcessNextWaveChunk( (int16_t *) pb_p16_ptr ) != PB_Playing ) { return PB_Error; }
    pb_p16_ptr += p_advance;
    half_to_fill = FIRST;
  }
  else if( pb_mode == 8 ) {
    if( ProcessNextWaveChunk_8_bit( (uint8_t *) pb_p8_ptr ) != PB_Playing ) { return PB_Error; }
    half_to_fill = SECOND;
    if( ProcessNextWaveChunk_8_bit( (uint8_t *) pb_p8_ptr ) != PB_Playing ) { return PB_Error; }
    pb_p8_ptr += p_advance;
    half_to_fill = FIRST;
  }
  else if( pb_mode == PB_MODE_IMA_ADPCM ) {
    if( ProcessNextWaveChunk_ADPCM( (uint8_t *) pb_padpcm_ptr ) != PB_Playing ) { return PB_Error; }
    pb_padpcm_ptr += p_advance;

    half_to_fill = SECOND;
    if( ProcessNextWaveChunk_ADPCM( (uint8_t *) pb_padpcm_ptr ) != PB_Playing ) { return PB_Error; }
    pb_padpcm_ptr += p_advance;
    half_to_fill = FIRST;
  }
  
  // Start playback of the recording
  //
  if( dac_power_control == true ) {
    AudioEngine_DACSwitch( DAC_ON );  // Ensure DAC is powered on before starting playback
  }

  pb_state = PB_Playing;
  dma_config();
  spi_config( playback_speed );
  return PB_Playing;
}


/** Simple function that waits for the end of playback.
  *
  * @param: none
  * @retval: PB_StatusTypeDef indicating success or failure.
  *
  */
PB_StatusTypeDef WaitForSampleEnd( void )
{
  while( pb_state == PB_Playing || pb_state == PB_Pausing || pb_state == PB_Paused ) {
    __NOP();  // Prevent optimizer from removing loop
  }
  
  // Cleanup: Stop DMA transmission now that we're out of the callback context
  // This prevents the I2S_WaitFlagStateUntilTimeout hang that occurs when
  // stopping from within the DMA callback
  if( pb_state != PB_Playing ) {
  dma_interrupt_disable( DMA0, DMA_CH4, DMA_INT_HTF | DMA_INT_FTF );
  i2s_disable( PROJECT_SPI );
  }
  
  return pb_state;
}


/**
  * @brief Pause playback with a smooth fade-out
  * 
  * Saves the current playback position and initiates a fade-out over PAUSE_FADEOUT_SAMPLES.
  * float alpha_f = 1.0f - expf( -2.0f * 3.14159265359f * cutoff_hz / sample_rate_hz );
  * Call ResumePlayback() to continue from where it paused.
  * 
  * @retval PB_StatusTypeDef - Current playback state (PB_Playing while fading, PB_Paused when done)
  */
PB_StatusTypeDef PausePlayback( void )
{
  if( pb_state != PB_Playing ) {
    return pb_state;  // Can only pause while actively playing
  }
  
  /* Save current playback position before initiating pause */
  if( pb_mode == 16 ) {
    paused_sample_ptr = (const void *)pb_p16_ptr;
  } else if( pb_mode == 8 ) {
    paused_sample_ptr = (const void *)pb_p8_ptr;
  } else {
    paused_sample_ptr = (const void *)pb_padpcm_ptr;
  }

  /* Preserve remaining samples so resume doesn't skip the end-of-file logic */
  paused_samples_remaining = samples_remaining;
  
  /* Calculate current volume level if fading in */
  uint32_t fadeout_start_level = pause_fadeout_samples;
  
  if( fadein_samples_remaining > 0 ) {
    /* We're in the middle of fade-in. Calculate how far we've progressed. */
    uint32_t fadein_progress = fadein_samples - fadein_samples_remaining;
    /* Start the pause fadeout from the current volume level (linear progress maps to quadratic volume curve) */
    fadeout_start_level = ( fadein_progress * pause_fadeout_samples ) / fadein_samples;
  }
  else if( pb_mode == 16 || pb_mode == 8 || pb_mode == PB_MODE_IMA_ADPCM ) {
    /* Check if we're in the middle of end-of-file fadeout */
    uint32_t remaining_in_file = 0;
    if( pb_mode == 16 ) {
      ptrdiff_t remaining = pb_end16_ptr - pb_p16_ptr;
      if( remaining > 0 ) {
        remaining_in_file = (uint32_t)remaining;
      }
    } else if( pb_mode == 8 ) {
      ptrdiff_t remaining = pb_end8_ptr - pb_p8_ptr;
      if( remaining > 0 ) {
        remaining_in_file = (uint32_t)remaining;
      }
    } else {
      ptrdiff_t remaining = pb_endadpcm_ptr - pb_padpcm_ptr;
      if( remaining > 0 ) {
        remaining_in_file = (uint32_t)remaining << 1;
      }
    }
    
    if( remaining_in_file > 0 && remaining_in_file <= fadeout_samples ) {
      /* We're in the end-of-file fadeout window. Scale pause fadeout to start from current level.
         End-of-file fadeout uses: fade_mult = remaining_in_file^2 / fadeout_samples^2
         For continuity: remaining_in_file / fadeout_samples = fadeout_start_level / pause_fadeout_samples */
      fadeout_start_level = ( remaining_in_file * pause_fadeout_samples ) / fadeout_samples;
    }
  }
  
